# ========================================

a = 1000
b = a
c = int("1000")

# Ожиданиие: int, int, int
print("Типы:", type(a), type(b), type(c))

# Ожидание: целые числа (identity хэш-коды объектов или адреса в памяти). Первые два одинаковых (один и тот же объект).
print("Идентификаторы:", id(a), id(b), id(c))

# Ожидание: True, т.к. a = b = 1000 (сравнение по значению)
print("a == b:", a == b)

# Ожидание: True, т.к. a и b являются одним и тем же объектом в памяти (сравнение по ссылке)
print("a is b:", a is b)

# Ожидание: True, т.к. a = c = 1000 (сравнение по значению)
print("a == c:", a == c)

# Ожидание: False, т.к. a и c были созданы отдельно друг от друга, хотя имеют равные значения (сравнение по ссылке)
print("a is c:", a is c)

# ========================================

c = None
if c is None:
    print(f"c является None: тип {type(c)}, идентификатор {id(c)}")

# ========================================

first = "python"
second = "py" + "thon"

print(first == second)
print(first is second)

# ========================================
